<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Third</title>
</head>
<body>
    <?php
        // Task 1
        $a = 1;
        echo ($a == 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = 0;
        echo ($a == 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = -3;
        echo ($a == 0) ? 'Вірно' : 'Невірно' . "<br>";

        // Task 2
        $a = 1;
        echo ($a > 0) ? 'Вірно' : 'Невірно' . "<br>"; 
        $a = 0;
        echo ($a > 0) ? 'Вірно' : 'Невірно' . "<br>"; 
        $a = -3;
        echo ($a > 0) ? 'Вірно' : 'Невірно' . "<br>"; 

        // Task 3
        $a = 1;
        echo ($a < 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = 0;
        echo ($a < 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = -3;
        echo ($a < 0) ? 'Вірно' : 'Невірно' . "<br>";

        // Task 4
        $a = 1;
        echo ($a >= 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = 0;
        echo ($a >= 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = -3;
        echo ($a >= 0) ? 'Вірно' : 'Невірно' . "<br>";

        // Task 5
        $a = 1;
        echo ($a <= 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = 0;
        echo ($a <= 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = -3;
        echo ($a <= 0) ? 'Вірно' : 'Невірно' . "<br>";

        // Task 6
        $a = 1;
        echo ($a != 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = 0;
        echo ($a != 0) ? 'Вірно' : 'Невірно' . "<br>";
        $a = -3;
        echo ($a != 0) ? 'Вірно' : 'Невірно' . "<br>";

        // Task 7
        $a = 'test';
        echo ($a == 'test') ? 'Вірно' : 'Невірно' . "<br>";
        $a = 'тест';
        echo ($a == 'test') ? 'Вірно' : 'Невірно' . "<br>";
        $a = 3;
        echo ($a == 'test') ? 'Вірно' : 'Невірно' . "<br>";

        // Task 8
        $a = '1';
        echo ($a === '1') ? 'Вірно' : 'Невірно' . "<br>";
        $a = 1;
        echo ($a === '1') ? 'Вірно' : 'Невірно' . "<br>";
        $a = 3;
        echo ($a === '1') ? 'Вірно' : 'Невірно' . "<br>";

        // Task 9
        $a = 1;
        echo (empty($a)) ? 'Вірно' : 'Невірно' . "<br>";  
        $a = 3;
        echo (empty($a)) ? 'Вірно' : 'Невірно' . "<br>";  
        $a = -3;
        echo (empty($a)) ? 'Вірно' : 'Невірно' . "<br>";  
        $a = 0;
        echo (empty($a)) ? 'Вірно' : 'Невірно' . "<br>";  
        $a = null;
        echo (empty($a)) ? 'Вірно' : 'Невірно' . "<br>";  
        $a = true;
        echo (empty($a)) ? 'Вірно' : 'Невірно' . "<br>";  
        $a = '';
        echo (empty($a)) ? 'Вірно' : 'Невірно' . "<br>";  
        $a = '0';
        echo (empty($a)) ? 'Вірно' : 'Невірно' . "<br>"; 

        // Task 10
        $a = 1;
        echo (!empty($a)) ? 'Вірно' : 'Невірно' . "<br>";
        $a = '';
        echo (!empty($a)) ? 'Вірно' : 'Невірно' . "<br>";

        // Task 11
        $a = 3;
        echo (isset($a)) ? 'Вірно' : 'Невірно' . "<br>";
        $a = null;
        echo (isset($a)) ? 'Вірно' : 'Невірно' . "<br>";

        // Task 12
        $a = null;
        echo (!isset($a)) ? 'Вірно' : 'Невірно' . "<br>";
        $a = 0;
        echo (!isset($a)) ? 'Вірно' : 'Невірно' . "<br>";
        $a = false;
        echo (!isset($a)) ? 'Вірно' : 'Невірно' . "<br>";

        // Task 13
        $var = true;
        echo ($var) ? 'Вірно' : 'Невірно' . "<br>";

        if ($var) {
            echo 'Вірно' . "<br>";
        } else {
            echo 'Невірно' . "<br>";
        }

        $var = false;
        echo ($var) ? 'Вірно' : 'Невірно' . "<br>";

        if ($var) {
            echo 'Вірно' . "<br>";
        } else {
            echo 'Невірно' . "<br>";
        }

        // Task 14
        $var = true;
        echo (!$var) ? 'Вірно' : 'Невірно' . "<br>";

        if (!$var) {
            echo 'Вірно' . "<br>";
        } else {
            echo 'Невірно' . "<br>";
        }

        $var = false;
        echo (!$var) ? 'Вірно' : 'Невірно' . "<br>";

        if (!$var) {
            echo 'Вірно' . "<br>";
        } else {
            echo 'Невірно' . "<br>";
        }
        // Task 15
        $a = 5;
        echo (($a > 0) && ($a < 5)) ? 'Вірно' : 'Невірно' . "<br>"; 

        $a = 0;
        echo (($a > 0) && ($a < 5)) ? 'Вірно' : 'Невірно' . "<br>"; 

        $a = -3;
        echo (($a > 0) && ($a < 5)) ? 'Вірно' : 'Невірно' . "<br>"; 

        $a = 2;
        echo (($a > 0) && ($a < 5)) ? 'Вірно' : 'Невірно' . "<br>"; 
    ?>
</body>
</html>